{"created_at": "Wed Nov 25 17:10:16 +0000 2009", "id": 6055065988, "id_str": "6055065988", "full_text": "Transcript for Kelly Osbourne on addiction: 'People need to know rehab doesn't fix you'\n\nThat are GMA cover story in the wake of limited the denim bottoms overdose her friend Kelly Osborne is sharing her own struggle with addiction and relapses Lindsay gave his back that's really. Good morning again George we are now seeing just how the new mothers transparency with her personal struggle. Is being celebrated on social media and beyond there. Is a certain sympathy and encouragement for her that we haven't always seen with other stars who perhaps. Privately struggled or tried to covered up a no other celebrities are coming forward to talk about just how difficult addiction can be. As glamorous as the flashing lights and red carpet events started can also come with serious pitfalls as well. The stark reminder this morning is pop star Demi Lovato is still recovering LA hospital after suspected drug overdose. Now her friend Kelly Osborne is speaking out about her own struggles with sobriety. I can't imagine what Dan is going through right now I think though I know what it's like to have the whole world talking about healing on this wonderful state. I think people just need to showed love and prayed for and trip he had had a the British talk show and swimming. The 33 year old opened up about addiction and recovery the sad part about addiction is it does not discriminate it doesn't matter who you off. Way you come from what you believe in. If it takes hold of anyone an epic one if it can Osborne has entered multiple rehab facilities to deal with drug and alcohol addiction in the past I reached a spiritual -- I was so. I'm believe it being measured I didn't can't find it anymore and I didn't have what happened to me I didn't cash. Who I went cut next you a distinct cat out. Anything Kelly the daughter of Sharon and rock legend Ozzy Osbourne has the treatment facilities can help. But can't cure an addict who NASA fixed. You spend your whole entire life doing everything you can. Genetically companies again Osborne now says every single day she has to make it conscious decision. To keep moving forward. Not that I wanted to live that life is worth living I have an incredible family and friends and why am I allowed myself to be some measure boom. Lots of outrage from fans and celebrities like wishing Lovato well her ex boyfriend actor Wilmer Valderrama. Was among those who Peter visited the hospital this week showing his support she just has the support of so many tours she does a lot of people rooting for her thanks you can thank you thanks do with it.\n\nThis transcript has been automatically generated and may not be 100% accurate.", "truncated": false, "display_text_range": [0, 137], "entities": {"hashtags": [], "symbols": [], "user_mentions": [], "urls": []}, "source": "<a href=\"http://twitter.com\" rel=\"nofollow\">Twitter Web Client</a>", "in_reply_to_status_id": null, "in_reply_to_status_id_str": null, "in_reply_to_user_id": null, "in_reply_to_user_id_str": null, "in_reply_to_screen_name": null, "user": {"id": 23136254, "id_str": "23136254", "name": "Harrah's Vegas PR", "screen_name": "HIFOBpublicity", "location": "Las Vegas, NV ", "description": "PR team for Harrah's, Flamingo, Imperial Palace, O'Sheas &amp; Bill's in Las Vegas", "url": "http://t.co/rLNWnTLxNX", "entities": {"url": {"urls": [{"url": "http://t.co/rLNWnTLxNX", "expanded_url": "http://media.harrahs.com", "display_url": "media.harrahs.com", "indices": [0, 22]}]}, "description": {"urls": []}}, "protected": false, "followers_count": 2143, "friends_count": 231, "listed_count": 124, "created_at": "Fri Mar 06 23:32:41 +0000 2009", "favourites_count": 5, "utc_offset": null, "time_zone": null, "geo_enabled": false, "verified": false, "statuses_count": 148, "lang": null, "contributors_enabled": false, "is_translator": false, "is_translation_enabled": false, "profile_background_color": "9AE4E8", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme1/bg.png", "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme1/bg.png", "profile_background_tile": true, "profile_image_url": "http://pbs.twimg.com/profile_images/89488642/flv_strip_night_normal.jpg", "profile_image_url_https": "https://pbs.twimg.com/profile_images/89488642/flv_strip_night_normal.jpg", "profile_link_color": "0084B4", "profile_sidebar_border_color": "BDDCAD", "profile_sidebar_fill_color": "DDFFCC", "profile_text_color": "333333", "profile_use_background_image": true, "has_extended_profile": false, "default_profile": false, "default_profile_image": false, "following": false, "follow_request_sent": false, "notifications": false, "translator_type": "none", "withheld_in_countries": []}, "geo": null, "coordinates": null, "place": null, "contributors": null, "is_quote_status": false, "retweet_count": 1, "favorite_count": 0, "favorited": false, "retweeted": false, "lang": "en"}