{"created_at": "Thu Apr 26 20:21:31 +0000 2018", "id": 989600379653492736, "id_str": "989600379653492736", "full_text": "NORRISTOWN, Pa. — Bill Cosby, who once embodied the idealized American father on a wildly popular sitcom, was convicted of sexual assault on Thursday in a high-stakes retrial after a half-dozen women testified that the famed comedian drugged and assaulted them.\n\nThe jury found Cosby, 80, guilty on all three counts of aggravated indecent assault against one woman, Andrea Constand, 45, drawing an emotional reaction from his other accusers in the courtroom.\n\nThe verdict was one of the first major courtroom victories for the #MeToo movement, which has exposed sexual harassment and misconduct in entertainment, media, politics and beyond.\n\nUpon the reading of the first guilty verdict, several of Cosby's accusers sobbed and shook with joy. Cosby's head was bent slightly, eyes shut.\n\nAlthough Cosby has faced dozens of sexual misconduct allegations spanning decades, he has been charged criminally only in the Constand case. Constand, a former employee at Temple University in Philadelphia, testified that Cosby drugged and sexually assaulted her in his suburban Philadelphia home in January 2004.\n\nConstand maintained her composure as the verdict was read in Montgomery County Court of Common Pleas.\n\nCosby lashed out at prosecutors as they asked Judge Steven O'Neill to revoke his bail, suggesting that he was a flight risk.\n\nMontgomery County District Attorney Kevin Steele noted Cosby's wealth and said he had a plane.\n\n\"He doesn't have a plane, you asshole! I'm sick of it, you asshole!\" Cosby exclaimed.\n\nCosby faces a maximum sentence of 10 years and a fine of up to $25,000 on each count. He remains free on bail until sentencing. But he is unlikely to spend much time in jail.\n\nO'Neill said that because of Cosby's age and his medical condition — his eyesight is poor — \"I am not going to simply lock him up.\" Cosby has to surrender his passport and must remain in his nearby home, the judge said.\n\nLili Bernard, an accuser who once appeared as a guest on \"The Cosby Show,\" the groundbreaking 1980s sitcom that introduced an upper-middle-class black family to American viewers, let out a wail as the verdict was read. She began to cry, and court personnel escorted her from the courtroom.\n\n\"I feel like my faith in humanity is restored,\" she told reporters through tears outside the courthouse.\n\nCosby's attorneys said in brief remarks that they would \"very strongly\" appeal the verdict. Cosby's first trial ended in a mistrial in June.\n\n\"We are very disappointed by the verdict,\" Tom Mesereau, Cosby's lead attorney, said outside the courthouse. \"We don't think Mr. Cosby's guilty of anything, and the fight is not over.\"\n\nSteele lauded Constand and the other accusers for their bravery in standing up to Cosby over the years.\n\n\"The most important person in this is Andrea Constand — 14 years later, it may be easy to forget that she was the first courageous person that stood up in public,\" Steele said during a news conference. Constand stood next to the prosecutors, her hands folded in front of her, but she didn't speak.\n\n\"Her quiet courage and her actions through this have helped victims stand up,\" Steele said. \"I hope and I pray that our actions have shown that we will stand up with those victims.\"\n\nJanice Baker-Kinney, who testified that Cosby gave her Quaaludes and sexually assaulted her, told MSNBC after the verdict that \"the relief is overwhelming.\"\n\n\"I'm shaking with relief, and I can't stop sobbing,\" she said.\n\nGloria Allred, a lawyer who represents several of Cosby's accusers, praised the verdict while the women stood behind her, shoulder to shoulder, their arms around one another.\n\n\"I truly hope that his long list of victims will now be able to find some kind of peace,\" she told reporters.\n\nThe decision came Thursday afternoon on the second day of deliberations. Earlier, the judge read back part of the testimony of the defense's star witness, who said Constand once said she could frame a \"high-profile person.\"\n\nThe jury was also read back Cosby's testimony in a deposition he gave in 2005 after Constand filed a civil suit against him. In it, the comedian admitted giving a woman Quaaludes to have sex with her.\n\nCosby, who has repeatedly denied all the allegations against him, has said the sexual encounter with Constand was consensual. Cosby paid Constand nearly $3.4 million in 2006 to settle the civil case.\n\nThe verdict was the dramatic culmination of an 18-year case that spanned two criminal trials and multiple police investigations. Afterward, Carnegie Mellon University in Pittsburgh and the University of Notre Dame both announced that they were rescinding honorary degrees they had bestowed on Cosby, while Temple University, where Cosby received his bachelor's degree in 1971 and where he was a trustee for more than 30 years, said the conviction \"provides additional facts for the university to consider with respect\" to an honorary doctorate it gave him in 1991.\n\nAssistant District Attorney Kristen Feden portrayed Cosby as a sexual predator who used his TV image as a man of wholesome values to target women he believed he could silence. Prosecutors called five other women who alleged that Cosby also sexually assaulted them in a manner similar to the way he assaulted Constand.\n\n\"He preyed on Andrea Constand the same way he preyed on all those five women,\" Feden said.\n\nLast month, O'Neill ruled that the additional accusers could testify so the prosecution could try to establish that the assault on Constand fit a pattern or that Cosby knew what would happen when he drugged Constand.\n\nAttorneys for Cosby asked pointed questions about the accusers' histories of drug abuse, criminal backgrounds, personal relationships and sex lives.\n\nDefense attorneys were especially hard on Janice Dickinson, a former supermodel.\n\nMesereau asked Dickinson whether she had spread false rumors about being pregnant with Sylvester Stallone's child. She said the remark was an honest mistake.\n\nBill Cosby arrives at court for deliberations on Thursday. Brendan McDermid / Reuters\n\n\"I had sex with two men that month. He wasn't the only contender,\" she said, garnering smiles from the jury.\n\nDefense attorney Kathleen Bliss described Dickinson in closing arguments as a \"failed starlet\" and \"an aged-out model.\"\n\n\"It sounds like she has slept with every single guy on the planet,\" Bliss said. \"Is Ms. Dickinson really the moral beacon that women's movements want?\"\n\nThe defense also suggested that Constand and the other accusers were making false accusations in the hope of gaining fame or fortune.\n\nThey repeatedly pointed to the $3.4 million payout that Constand received from Cosby in 2006. And they highlighted Allred's proposal in 2014 to set aside a $100 million fund for victims of Cosby if he was unwilling to waive the statute of limitations to allow his accusers to confront him in court.\n\nSome of the questions and arguments drew scorn from observers in the courtroom.\n\nBernard, who sat in the courtroom for much of the trial, called the defense's closing argument highly offensive.\n\n\"It was based solely on rape myths, on victim blaming, on victim shaming and on a character assassination of really credible witnesses, of very righteous victims, of victims that were clearly telling the truth,\" Bernard told reporters as the jury deliberated Wednesday.\n\n\"It was just a display of utter misogyny and buffoonery, and you know, I'm just, like, 'Wow, how low can they go?' \" she said.\n\nThe #MeToo movement was a cloud over the defense's closing arguments Tuesday, with Bliss telling jurors that they shouldn't allow it to influence their decision.\n\n\"Don't get me wrong — bad things definitely happen. But, ladies and gentleman, not every accusation is true. Your common sense tells you that,\" Bliss said. \"We do have to deal with sexual assault. It's a worldwide problem, just like we do with sexual harassment, pay disparity, social inequality.\n\n\"But questioning an accuser is not shaming them,\" she added.\n\nMeredith Mandell and Adam Reiss reported from Norristown. Daniella Silva reported from New York.", "truncated": false, "display_text_range": [0, 256], "entities": {"hashtags": [{"text": "Ayekoo", "indices": [2, 9]}, {"text": "AroundTown", "indices": [10, 21]}, {"text": "Ayekoo", "indices": [222, 229]}, {"text": "Happychatroom", "indices": [230, 244]}, {"text": "Dontpushme", "indices": [245, 256]}], "symbols": [], "user_mentions": [{"screen_name": "BillCosby", "name": "Bill Cosby", "id": 54682125, "id_str": "54682125", "indices": [23, 33]}, {"screen_name": "BillCosbySays", "name": "Not Bill Cosby", "id": 1198939088, "id_str": "1198939088", "indices": [76, 90]}, {"screen_name": "MbBuabeng", "name": "Mercy Bee", "id": 2743268042, "id_str": "2743268042", "indices": [123, 133]}, {"screen_name": "BlackBillsGh", "name": "Black Bills", "id": 1190784410, "id_str": "1190784410", "indices": [134, 147]}, {"screen_name": "EugeneVidzro", "name": "eugene vidzro", "id": 1111724216, "id_str": "1111724216", "indices": [148, 161]}, {"screen_name": "kabuteyamevor", "name": "iamkabuteyamevor", "id": 827909167, "id_str": "827909167", "indices": [162, 176]}, {"screen_name": "sweet_adoma", "name": "SWEET ADOMA PAPABI", "id": 940845834404597760, "id_str": "940845834404597760", "indices": [177, 189]}, {"screen_name": "mac_okocha", "name": "MAC-PARADISE OKOCHA", "id": 515613862, "id_str": "515613862", "indices": [199, 210]}, {"screen_name": "TKarikari", "name": "TK", "id": 539084241, "id_str": "539084241", "indices": [211, 221]}], "urls": [], "media": [{"id": 989600345847488512, "id_str": "989600345847488512", "indices": [257, 280], "media_url": "http://pbs.twimg.com/media/DbvERXvX4AAVJ5K.jpg", "media_url_https": "https://pbs.twimg.com/media/DbvERXvX4AAVJ5K.jpg", "url": "https://t.co/crmzZB1Rs6", "display_url": "pic.twitter.com/crmzZB1Rs6", "expanded_url": "https://twitter.com/djadvicer10/status/989600379653492736/photo/1", "type": "photo", "sizes": {"thumb": {"w": 150, "h": 150, "resize": "crop"}, "small": {"w": 680, "h": 340, "resize": "fit"}, "medium": {"w": 1000, "h": 500, "resize": "fit"}, "large": {"w": 1000, "h": 500, "resize": "fit"}}}]}, "extended_entities": {"media": [{"id": 989600345847488512, "id_str": "989600345847488512", "indices": [257, 280], "media_url": "http://pbs.twimg.com/media/DbvERXvX4AAVJ5K.jpg", "media_url_https": "https://pbs.twimg.com/media/DbvERXvX4AAVJ5K.jpg", "url": "https://t.co/crmzZB1Rs6", "display_url": "pic.twitter.com/crmzZB1Rs6", "expanded_url": "https://twitter.com/djadvicer10/status/989600379653492736/photo/1", "type": "photo", "sizes": {"thumb": {"w": 150, "h": 150, "resize": "crop"}, "small": {"w": 680, "h": 340, "resize": "fit"}, "medium": {"w": 1000, "h": 500, "resize": "fit"}, "large": {"w": 1000, "h": 500, "resize": "fit"}}}]}, "source": "<a href=\"http://twitter.com\" rel=\"nofollow\">Twitter Web Client</a>", "in_reply_to_status_id": null, "in_reply_to_status_id_str": null, "in_reply_to_user_id": null, "in_reply_to_user_id_str": null, "in_reply_to_screen_name": null, "user": {"id": 236133740, "id_str": "236133740", "name": "djadvicer(HAPPY 98.9", "screen_name": "DjAdvicer", "location": "Ghana ,Accra", "description": "DJ|PRESENTER @ HAPPY 98.9 FM|.HOST OF DRIVE TIME(AYEKOO)|HEAD OF DJs|HILIFE DJ OF THE YEAR(2012|BEST MUSIC PROMOTER(2016/17/18|19VOICE OVER ARTIST|MC|0271609924", "url": "https://t.co/yUGZvjX6Qd", "entities": {"url": {"urls": [{"url": "https://t.co/yUGZvjX6Qd", "expanded_url": "http://djadvicer.com", "display_url": "djadvicer.com", "indices": [0, 23]}]}, "description": {"urls": []}}, "protected": false, "followers_count": 10931, "friends_count": 1574, "listed_count": 14, "created_at": "Sun Jan 09 21:57:21 +0000 2011", "favourites_count": 17133, "utc_offset": null, "time_zone": null, "geo_enabled": true, "verified": false, "statuses_count": 40677, "lang": null, "contributors_enabled": false, "is_translator": false, "is_translation_enabled": false, "profile_background_color": "C0DEED", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme1/bg.png", "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme1/bg.png", "profile_background_tile": false, "profile_image_url": "http://pbs.twimg.com/profile_images/1218443851670736897/F_iXrFNh_normal.jpg", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1218443851670736897/F_iXrFNh_normal.jpg", "profile_banner_url": "https://pbs.twimg.com/profile_banners/236133740/1486926745", "profile_link_color": "1DA1F2", "profile_sidebar_border_color": "C0DEED", "profile_sidebar_fill_color": "DDEEF6", "profile_text_color": "333333", "profile_use_background_image": true, "has_extended_profile": true, "default_profile": true, "default_profile_image": false, "following": false, "follow_request_sent": false, "notifications": false, "translator_type": "none", "withheld_in_countries": []}, "geo": null, "coordinates": null, "place": {"id": "c08f5915ceeeb806", "url": "https://api.twitter.com/1.1/geo/id/c08f5915ceeeb806.json", "place_type": "country", "name": "Ghana", "full_name": "Ghana", "country_code": "GH", "country": "Ghana", "contained_within": [], "bounding_box": {"type": "Polygon", "coordinates": [[[-3.2599659, 4.677051], [1.2360215, 4.677051], [1.2360215, 11.1738377], [-3.2599659, 11.1738377]]]}, "attributes": {}}, "contributors": null, "is_quote_status": false, "retweet_count": 1, "favorite_count": 1, "favorited": false, "retweeted": false, "possibly_sensitive": false, "possibly_sensitive_appealable": false, "lang": "en"}