{"created_at": "Wed Aug 31 20:15:05 +0000 2016", "id": 771078878529892353, "id_str": "771078878529892353", "full_text": "UNHCR, the UN Refugee Agency, has welcomed news of the arrival in the United States this week of the 10,000th refugee from the conflict in Syria, and calls for greater global solidarity ahead of summits next month that will look at ways to increase efforts to deal with the unprecedented refugee crisis worldwide.\n\n“The United States has long been a leader in welcoming people fleeing global persecution and the arrival on Monday of the 10,000th Syrian refugee is a further expression of this leadership,” said UNHCR Regional Representative in the United States, Shelly Pitterman.\n\n“We thank the communities in the United States that have kept their doors open and also our civil society partners for their tireless humanitarian efforts. Much more needs to be done for Syrian refugees and for the global crisis that has seen more people flee persecution than at any time ever recorded.”\n\nAt the end of 2015, war, conflict and persecution had forced 65.3 million people globally to flee for their lives, an all-time high. The Syrian refugee crisis is the world’s largest and more than 4.8 million have fled mostly to neighbouring countries whose resources are stretched thin so that increasing numbers of refugees live below national poverty lines.\n\nTo aid the most vulnerable refugees and to share the tremendous burden of these refugee-hosting countries, UNHCR has called on governments to resettle those most at risk. So far resettlement countries have pledged a total of more than 220,000 places for Syrians under resettlement and other humanitarian admissions programmes. Around 478,000 Syrians are considered to be in need of resettlement – close to 40 per cent of the 1.19 million people who are in need of resettlement globally.\n\nUNHCR recognizes that opportunities for resettlement are extremely limited and so reserves this for persons who are most at risk, such as unaccompanied children, women-headed households, victims of torture, and persons with special medical needs. UNHCR identifies and carefully screens all refugees before they are referred to a country for resettlement. In the case of the United States, all refugees who are referred then undergo extensive face-to-face interviews with Department of Homeland Security officers, along with multiple layers of identity and security checks in a thorough process undertaken by US authorities.\n\nUNHCR calls for increased efforts to provide Syrian refugees with additional safe and regular pathways for admission. The United Nations General Assembly Summit for Refugees and Migrants on 19 September and the President of the United States Summit on Refugees on 20 September will provide opportunities for countries to show solidarity with refugee-hosting countries across the globe by giving Syrian and other vulnerable refugee groups legal opportunities to access safety and protection through resettlement and other pathways for admission.\n\n“Resettling refugees, along with continued humanitarian funding, is a critical form of solidarity with refugee-hosting countries and it needs to be expanded worldwide,” said Pitterman.", "truncated": false, "display_text_range": [0, 136], "entities": {"hashtags": [{"text": "UNHCR", "indices": [0, 6]}], "symbols": [], "user_mentions": [], "urls": [{"url": "https://t.co/MElGjE77X5", "expanded_url": "http://bit.ly/2bT3Wjw", "display_url": "bit.ly/2bT3Wjw", "indices": [113, 136]}]}, "source": "<a href=\"http://twitterfeed.com\" rel=\"nofollow\">twitterfeed</a>", "in_reply_to_status_id": null, "in_reply_to_status_id_str": null, "in_reply_to_user_id": null, "in_reply_to_user_id_str": null, "in_reply_to_screen_name": null, "user": {"id": 141267300, "id_str": "141267300", "name": "Ibrahima Diané", "screen_name": "Afrikibou", "location": "Reading, England - Beni, DRC", "description": "Journalist - Head of Field Office for @refugees in Eastern DRC, based in Beni - Ex-BBC (Editor, Editor Dakar Bureau, Producer @BBCAfrique) Arsenal FC fan", "url": "https://t.co/aumRelZohp", "entities": {"url": {"urls": [{"url": "https://t.co/aumRelZohp", "expanded_url": "http://unhcr.org", "display_url": "unhcr.org", "indices": [0, 23]}]}, "description": {"urls": []}}, "protected": false, "followers_count": 3287, "friends_count": 1436, "listed_count": 107, "created_at": "Fri May 07 16:29:30 +0000 2010", "favourites_count": 609, "utc_offset": null, "time_zone": null, "geo_enabled": true, "verified": false, "statuses_count": 29443, "lang": null, "contributors_enabled": false, "is_translator": false, "is_translation_enabled": false, "profile_background_color": "000000", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme9/bg.gif", "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme9/bg.gif", "profile_background_tile": false, "profile_image_url": "http://pbs.twimg.com/profile_images/1032264496981655552/6AMRMzeJ_normal.jpg", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1032264496981655552/6AMRMzeJ_normal.jpg", "profile_banner_url": "https://pbs.twimg.com/profile_banners/141267300/1534946012", "profile_link_color": "1B95E0", "profile_sidebar_border_color": "000000", "profile_sidebar_fill_color": "000000", "profile_text_color": "000000", "profile_use_background_image": false, "has_extended_profile": true, "default_profile": false, "default_profile_image": false, "following": false, "follow_request_sent": false, "notifications": false, "translator_type": "none", "withheld_in_countries": []}, "geo": null, "coordinates": null, "place": null, "contributors": null, "is_quote_status": false, "retweet_count": 1, "favorite_count": 0, "favorited": false, "retweeted": false, "possibly_sensitive": false, "possibly_sensitive_appealable": false, "lang": "en"}