{"created_at": "Mon Jun 04 19:53:51 +0000 2018", "id": 1003726547629600768, "id_str": "1003726547629600768", "full_text": "Woody Allen has spoken about his support for the #MeToo movement, saying that he should be “the poster boy”.\n\nIn an interview on Argentinian news program Periodismo Para Todos, the writer-director was asked if there was any truth behind the allegation that he sexually abused his daughter, Dylan Farrow.\n\n“Of course not, this is just so crazy,” he said. “This is something that has been thoroughly looked at 25 years ago by all the authorities and everybody came to the conclusion that it was untrue. And that was the end and I’ve gone on with my life. For it to come back now, it’s a terrible thing to accuse a person of. I’m a man with a family and my own children.”\n\nThe story was resurfaced after allegations were made against Harvey Weinstein and other key figures in Hollywood of sexually predatory behavior. It led to many actors talking about their regret over working with Allen, including Greta Gerwig, Colin Firth and Ellen Page.\n\n“Everyone wants justice to be done,” Allen said. “If there is something like the #MeToo movement now, you root for them, you want them to bring to justice these terrible harassers, these people who do all these terrible things. And I think that’s a good thing.”\n\nBut the 82-year-old is frustrated that his name has been used alongside the men accused of misconduct. He said that the people who have been accused by multiple women shouldn’t be equated with him, as he was “only accused by one woman in a child custody case” and believes he should be heralded as an important ally.\n\n“As I say, I’m a big advocate of the #MeToo movement,” he said. “I feel when they find people who harass innocent women and men, it’s a good thing that they’re exposing them. But you know I, I should be the poster boy for the #MeToo movement. Because I have worked in movies for 50 years. I’ve worked with hundreds of actresses and not a single one – big ones, famous ones, ones starting out – have ever, ever suggested any kind of impropriety at all. I’ve always had a wonderful record with them.”\n\nIn a statement released last year, Allen referred to Weinstein as a “sad, sick man”.\n\nLast month saw Allen’s son Moses Farrow defend him in a blogpost, calling his sister’s story a “discredited allegation” and accusing his mother, Mia Farrow, of “brainwashing” and abusive behavior. In response, Dylan Farrow called his words “beyond hurtful”.\n\nWhen he made similar accusations in a book published in September 2017, Mia Farrow said in a statement: “Moses has cut off his entire family including his ex-wife, who was pregnant when he left. It’s heartbreaking and bewildering that he would make this up, perhaps to please Woody. We all miss and love him very much.”\n\nAllen’s next film, A Rainy Day in New York, faces an uncertain future after stars Timothée Chalamet, Selena Gomez and Rebecca Hall donated their salaries to various charities. The romantic comedy is yet to receive a release date.", "truncated": false, "display_text_range": [0, 112], "entities": {"hashtags": [{"text": "MeToo", "indices": [73, 79]}], "symbols": [], "user_mentions": [], "urls": [{"url": "https://t.co/t8Ac83F3ab", "expanded_url": "http://peoplem.ag/kvkxBu1", "display_url": "peoplem.ag/kvkxBu1", "indices": [89, 112]}]}, "source": "<a href=\"http://www.socialflow.com\" rel=\"nofollow\">SocialFlow</a>", "in_reply_to_status_id": null, "in_reply_to_status_id_str": null, "in_reply_to_user_id": null, "in_reply_to_user_id_str": null, "in_reply_to_screen_name": null, "user": {"id": 25589776, "id_str": "25589776", "name": "People", "screen_name": "people", "location": "", "description": "The #1 source for celebrity news and inspiring stories. It's here! 🌟 Listen to PEOPLE Every Day, our new daily podcast: https://t.co/L2YP1S2wZP", "url": "https://t.co/2JMO2KoE3y", "entities": {"url": {"urls": [{"url": "https://t.co/2JMO2KoE3y", "expanded_url": "http://www.people.com", "display_url": "people.com", "indices": [0, 23]}]}, "description": {"urls": [{"url": "https://t.co/L2YP1S2wZP", "expanded_url": "https://peoplem.ag/36wHd8I", "display_url": "peoplem.ag/36wHd8I", "indices": [120, 143]}]}}, "protected": false, "followers_count": 7662161, "friends_count": 1723, "listed_count": 31101, "created_at": "Fri Mar 20 22:30:24 +0000 2009", "favourites_count": 4832, "utc_offset": null, "time_zone": null, "geo_enabled": true, "verified": true, "statuses_count": 337784, "lang": null, "contributors_enabled": false, "is_translator": false, "is_translation_enabled": false, "profile_background_color": "08A8E7", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme1/bg.png", "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme1/bg.png", "profile_background_tile": true, "profile_image_url": "http://pbs.twimg.com/profile_images/703345483218067456/waTSntUG_normal.jpg", "profile_image_url_https": "https://pbs.twimg.com/profile_images/703345483218067456/waTSntUG_normal.jpg", "profile_banner_url": "https://pbs.twimg.com/profile_banners/25589776/1615586957", "profile_link_color": "008EED", "profile_sidebar_border_color": "FFFFFF", "profile_sidebar_fill_color": "FFEE9A", "profile_text_color": "000000", "profile_use_background_image": true, "has_extended_profile": false, "default_profile": false, "default_profile_image": false, "following": false, "follow_request_sent": false, "notifications": false, "translator_type": "none", "withheld_in_countries": []}, "geo": null, "coordinates": null, "place": null, "contributors": null, "is_quote_status": false, "retweet_count": 3, "favorite_count": 20, "favorited": false, "retweeted": false, "possibly_sensitive": false, "possibly_sensitive_appealable": false, "lang": "en"}