{"created_at": "Tue Jul 17 21:02:19 +0000 2018", "id": 1019326454260293632, "id_str": "1019326454260293632", "full_text": "Lisa Page, former FBI lawyer under James Comey and Andrew McCabe, has become the latest rat to depart the sinking ship.\n\nAccording to testimony given by Page during two days of closed-door House hearings, former bosses at the FBI instructed her to cover-up the fact that China, not Russia, hacked the DNC server.\n\nBYPASS THE CENSORS Sign up to get unfiltered news delivered straight to your inbox. Email *\n\nTruepundit.com reports: The embattled Page tossed James Comey, Andrew McCabe, Peter Strzok and Bill Priestap among others under the Congressional bus, alleging the upper echelon of the FBI concealed intelligence confirming Chinese state-backed ‘assets’ had illegally acquired former Secretary of State Hillary Clinton’s 30,000+ “missing” emails, federal sources said.\n\nThe Russians didn’t do it. The Chinese did, according to well-placed FBI sources.\n\nAnd while Democratic lawmakers and the mainstream media prop up Russia as America’s boogeyman, it was the ironically Chinese who acquired Hillary’s treasure trove of classified and top secret intelligence from her home-brewed private server.\n\nAnd a public revelation of that magnitude — publicizing that a communist world power intercepted Hillary’s sensitive and top secret emails — would have derailed Hillary Clinton’s presidential hopes. Overnight. But it didn’t simply because it was concealed.\n\nFBI bosses knew of the breach yet did nothing to investigate, seemingly trying to run out the clock on the alarming revelations to protect Hillary during her heated presidential campaign with Trump. So instead of investigating the hacking of Clinton’s server, FBI bosses sat quietly.\n\nAnd did nothing to confirm the Chinese assets were linked to their government. Or assess the damage such a tremendous breach posed to national security. Did the Chinese government access Hillary’s emails? The FBI didn’t care enough to investigate at the risk of besmirching Clinton and further soiling her during the election.\n\nHundreds of top secret documents and even the president’s daily travel and security itineraries were on that server — and intercepted by a communist country — yet the FBI sat on the evidence. Likewise, all of Clinton’s and her inner circle’s outgoing emails were compromised as well, sources confirmed.\n\nEven the Inspector General had tipped off the FBI — specifically Strzok — about the foreign breach. Still, no timely case was pursued.\n\nThat same cover-up pattern fits FBI bosses who time after time stalled and concealed other criminal intelligence on Clinton in the weeks prior to the election.\n\nWe could write more detail here and ramble on and on but at this point, we simply ask.\n\nIs anyone going to go to prison for politicizing the FBI and covering up countless crimes committed by FBI personnel in a variety of coordinated schemes to protect Hillary and the Democrats?", "truncated": false, "display_text_range": [0, 91], "entities": {"hashtags": [], "symbols": [], "user_mentions": [{"screen_name": "YouTube", "name": "YouTube", "id": 10228272, "id_str": "10228272", "indices": [83, 91]}], "urls": [{"url": "https://t.co/JitxkdTplE", "expanded_url": "http://youtu.be/JXQaRFe6XP4?a", "display_url": "youtu.be/JXQaRFe6XP4?a", "indices": [55, 78]}]}, "source": "<a href=\"https://www.google.com/\" rel=\"nofollow\">Google</a>", "in_reply_to_status_id": null, "in_reply_to_status_id_str": null, "in_reply_to_user_id": null, "in_reply_to_user_id_str": null, "in_reply_to_screen_name": null, "user": {"id": 2361191996, "id_str": "2361191996", "name": "LATEST CONSPIRACY TH", "screen_name": "Ngheo12345", "location": "", "description": "", "url": null, "entities": {"description": {"urls": []}}, "protected": false, "followers_count": 32, "friends_count": 301, "listed_count": 1, "created_at": "Tue Feb 25 14:43:23 +0000 2014", "favourites_count": 44, "utc_offset": null, "time_zone": null, "geo_enabled": false, "verified": false, "statuses_count": 4979, "lang": null, "contributors_enabled": false, "is_translator": false, "is_translation_enabled": false, "profile_background_color": "C0DEED", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme1/bg.png", "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme1/bg.png", "profile_background_tile": false, "profile_image_url": "http://pbs.twimg.com/profile_images/849908131098275840/MI296seq_normal.jpg", "profile_image_url_https": "https://pbs.twimg.com/profile_images/849908131098275840/MI296seq_normal.jpg", "profile_banner_url": "https://pbs.twimg.com/profile_banners/2361191996/1491468810", "profile_link_color": "1DA1F2", "profile_sidebar_border_color": "C0DEED", "profile_sidebar_fill_color": "DDEEF6", "profile_text_color": "333333", "profile_use_background_image": true, "has_extended_profile": false, "default_profile": true, "default_profile_image": false, "following": false, "follow_request_sent": false, "notifications": false, "translator_type": "none", "withheld_in_countries": []}, "geo": null, "coordinates": null, "place": null, "contributors": null, "is_quote_status": false, "retweet_count": 1, "favorite_count": 1, "favorited": false, "retweeted": false, "possibly_sensitive": false, "possibly_sensitive_appealable": false, "lang": "en"}