{"created_at": "Thu Jun 21 18:43:18 +0000 2018", "id": 1009869386038038529, "id_str": "1009869386038038529", "full_text": "Blake Shelton is opening up about his relationship with Gwen Stefani.\n\nThe country star appears on Sunday's upcoming episode of Sunday TODAY With Willie Geist and gives insight into the start of his relationship with the pop princess.\n\n\"When I was going through my divorce and just hit rock bottom, just like anyone does when they go through something that devastating, it's a miracle that I met somebody that was going through the same exact thing that I was at the exact same moment in time,\" Shelton, 42, says.\n\nBoth Shelton and Stefani, 48, divorced their partners — Miranda Lambert and Gavin Rossdale respectively — in 2015, before confirming their relationship in November of that year. For that reason, many people, Shelton and Stefani included, assumed they would have a quick rebound relationship.\n\n\"I think if Gwen and I were being honest right now talking about this, I think in the back of our minds we both kind of thought this is a rebound deal,\" Shelton reveals. \"I mean, because we're both coming out of a pretty low spot in our lives and we're kind of clinging to each other to get through this.\"\n\nThe couple is still going strong, though.\n\n\"Now here we are, going on three years later, and every day that goes by it just feels like a stronger bond between the two of us and it constantly feels like it's going to the next level,\" Shelton says. \"That's the only way I think either one of us could describe it if she was sitting right here.\"\n\nThe musicians have been especially sweet the last couple of weeks. Stefani celebrated Shelton's birthday over the weekend with dinner at BOA Steakhouse in West Hollywood, California, and a cookout on Father's Day. On Tuesday, Stefani shared snaps from her time with Shelton in his home state of Oklahoma. The couple, along with Stefani's sons — Kingston, 12, Zuma, 9, and Apollo, 4 — spent time on a boat and out in nature.\n\nDespite their obvious love for each other, the duo is in no rush to tie the knot.\n\n\"There is no reason for them to rush into a marriage, so they aren’t,\" a source exclusively told ET back in March. \"Both of them are happy and content with where their relationship is right now.\"\n\nThe source continued: \"They are on cloud nine for each other. They are perfect for each other. They know they have found their true soulmate.\"\n\nIn April, however, the country superstar admitted to thinking about marrying his longtime love.\n\n\"I think about [marrying her]. I don't think it's anytime soon or anything,\" he said during an interview with CMT. \"The more time that goes by, I guess, the closer you'd be getting to that.\"\n\nFor more on the couple, watch below:\n\nBlake Shelton Admits He Thinks About Marrying Gwen Stefani, But It Won't Happen Soon This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRELATED CONTENT:\n\nGwen Stefani Thanks Blake Shelton For 'Sharing His World' With Her -- See the Pic!\n\nGwen Stefani Serenades Blake Shelton for His 42nd Birthday\n\nGwen Stefani Attends Wedding with Blake Shelton, Dances to 'Hollaback Girl' at Reception: Watch!\n\nRelated Gallery", "truncated": false, "display_text_range": [0, 128], "entities": {"hashtags": [], "symbols": [], "user_mentions": [], "urls": [{"url": "https://t.co/0Px7t1b9x2", "expanded_url": "https://shar.es/anKGrG", "display_url": "shar.es/anKGrG", "indices": [105, 128]}]}, "source": "<a href=\"http://twitter.com\" rel=\"nofollow\">Twitter Web Client</a>", "in_reply_to_status_id": null, "in_reply_to_status_id_str": null, "in_reply_to_user_id": null, "in_reply_to_user_id_str": null, "in_reply_to_screen_name": null, "user": {"id": 477926650, "id_str": "477926650", "name": "rebecca lauren SLOW CLAP OUT NOW", "screen_name": "rebeccaalpert1", "location": "", "description": "Part time Editor, NCC student Sports Fan and proud member of the shefani fandom stream #LMRM and #MW #slowclap out today https://t.co/OrCi1g2v3O…", "url": null, "entities": {"description": {"urls": [{"url": "https://t.co/OrCi1g2v3O", "expanded_url": "http://giphy.com/channel/rebecc", "display_url": "giphy.com/channel/rebecc", "indices": [121, 144]}]}}, "protected": false, "followers_count": 3092, "friends_count": 5001, "listed_count": 168, "created_at": "Sun Jan 29 18:28:18 +0000 2012", "favourites_count": 1251096, "utc_offset": null, "time_zone": null, "geo_enabled": true, "verified": false, "statuses_count": 909989, "lang": null, "contributors_enabled": false, "is_translator": false, "is_translation_enabled": false, "profile_background_color": "C0DEED", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme1/bg.png", "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme1/bg.png", "profile_background_tile": false, "profile_image_url": "http://pbs.twimg.com/profile_images/1344839330590818305/5ADQI0x-_normal.jpg", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1344839330590818305/5ADQI0x-_normal.jpg", "profile_banner_url": "https://pbs.twimg.com/profile_banners/477926650/1607129990", "profile_link_color": "1DA1F2", "profile_sidebar_border_color": "C0DEED", "profile_sidebar_fill_color": "DDEEF6", "profile_text_color": "333333", "profile_use_background_image": true, "has_extended_profile": true, "default_profile": true, "default_profile_image": false, "following": false, "follow_request_sent": false, "notifications": false, "translator_type": "none", "withheld_in_countries": []}, "geo": null, "coordinates": null, "place": null, "contributors": null, "is_quote_status": false, "retweet_count": 1, "favorite_count": 12, "favorited": false, "retweeted": false, "possibly_sensitive": false, "possibly_sensitive_appealable": false, "lang": "en"}