{"created_at": "Fri Feb 23 20:21:13 +0000 2018", "id": 967132259869487105, "id_str": "967132259869487105", "full_text": "SMALL BUSINESS ECONOMIC TRENDS\n\nThe NFIB Small Business Optimism Index rose 2.4 points in March to 98.2. March’s reading is the first return to the average historical reading since last November. The NFIB Uncertainty Index increased six points to 81, which was primarily driven by owners being more uncertain about whether it is a good time to expand their business and make capital expenditures in the coming months.\n\n“Main Street is doing better as state and local restrictions are eased, but finding qualified labor is a critical issue for small businesses nationwide,” said NFIB Chief Economist Bill Dunkelberg. “Small business owners are competing with the pandemic and increased unemployment benefits that are keeping some workers out of the labor force. However, owners remain determined to hire workers and grow their business.”\n\nOther key findings include: Seven of the 10 Index components improved and three declined. Sales expectations over the next three months improved eight points to a net 0% of owners, a historically low level. Earnings trends over the past three months declined four points to a net negative 15%.\n\nAs reported in NFIB’s monthly jobs report, 42% of owners reported job openings that could not be filled, a record high reading. Owners continue to have difficulty finding qualified workers to fill jobs as they compete with increased unemployment benefits and the pandemic keeping some workers out of the labor force.\n\nA net 28% of owners reported raising compensation (up three points) and the highest level in the past 12 months. A net 17% plan to raise compensation in the next three months, down two points.\n\nSeven percent of owners cited labor costs as their top business problem and 24% said that labor quality was their top business problem. Finding eligible workers to fill open positions will become increasingly difficult for small business owners.\n\nFifty-nine percent of owners reported capital outlays in the next six months, up two points from February. Of those making expenditures, 41% reported spending on new equipment, 26% acquired vehicles, and 14% improved or expanded facilities. Six percent acquired new buildings or land for expansion and 11% spent money for new fixtures and furniture.\n\nTwenty percent of owners plan capital outlays in the next few months, down three points from February. Owners are not planning on investing in their businesses as expected future sales and business conditions remain below average.\n\nA net negative 6% of all owners (seasonally adjusted) reported higher nominal sales in the past three months, down eight points from February. The net percent of owners expecting higher real sales volumes improved eight points to a net negative 0%.\n\nThe net percent of owners reporting inventory increases decreased two points to a net negative 5%. A net 3% of owners view current inventory stocks as “too low” in March, down two points but remaining at historically high levels. A net 4% of owners plan inventory investment in the coming months, up two points from February.\n\nThe net percent of owners raising average selling prices increased one point to a net 26% (seasonally adjusted). Eight percent of owners reported lower average selling prices and 36% reported higher average prices. Price hikes were the most frequent in wholesale (65% higher, 5% lower) and retail (48% higher, 5% lower). A net 34% (seasonally adjusted) plan price hikes.\n\nThe frequency of reports of positive profit trends declined four points to a net negative 15% reporting quarter on quarter profit improvements. Sales have not yet improved enough for owners to report higher earnings.\n\nAmong those owners reporting lower profits, 46% blamed weaker sales, 15% cited the usual seasonal change, 10% cited a higher cost of materials, 5% cited labor costs, 5% cited lower prices, and 4% cited higher taxes or regulatory costs. For owners reporting higher profits, 68% credited sales volumes, 12% cited usual seasonal change, and 7% cited higher prices.\n\nTwo percent of owners reported that all of their borrowing needs were not satisfied. Twenty-seven percent reported all credit needs were met and 59% said they were not interested in a loan. A net 1% reported that their last loan was harder to get than in previous attempts. One percent of owners reported that financing was their top business problem. The net percent of owners reporting paying a higher rate on their most recent loan was 0%, up two points from February", "truncated": false, "display_text_range": [0, 223], "entities": {"hashtags": [{"text": "Smallbiz", "indices": [190, 199]}], "symbols": [], "user_mentions": [], "urls": [{"url": "https://t.co/FCLMVMnPFq", "expanded_url": "http://ow.ly/pPrV30iAcCN", "display_url": "ow.ly/pPrV30iAcCN", "indices": [200, 223]}]}, "source": "<a href=\"http://www.hootsuite.com\" rel=\"nofollow\">Hootsuite</a>", "in_reply_to_status_id": null, "in_reply_to_status_id_str": null, "in_reply_to_user_id": null, "in_reply_to_user_id_str": null, "in_reply_to_screen_name": null, "user": {"id": 868603454, "id_str": "868603454", "name": "Charles Owens", "screen_name": "OwensNFIB", "location": "", "description": "I have been advocating the interests of small business in the State Legislature for more than 35 years. Any opinions expressed are my own.", "url": "http://t.co/6CrUPvkDNP", "entities": {"url": {"urls": [{"url": "http://t.co/6CrUPvkDNP", "expanded_url": "http://www.nfib.com/michigan", "display_url": "nfib.com/michigan", "indices": [0, 22]}]}, "description": {"urls": []}}, "protected": false, "followers_count": 577, "friends_count": 132, "listed_count": 54, "created_at": "Mon Oct 08 20:07:02 +0000 2012", "favourites_count": 3, "utc_offset": null, "time_zone": null, "geo_enabled": false, "verified": false, "statuses_count": 2048, "lang": null, "contributors_enabled": false, "is_translator": false, "is_translation_enabled": false, "profile_background_color": "C0DEED", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme1/bg.png", "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme1/bg.png", "profile_background_tile": false, "profile_image_url": "http://pbs.twimg.com/profile_images/1361073921488019461/FUzBO43g_normal.jpg", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1361073921488019461/FUzBO43g_normal.jpg", "profile_banner_url": "https://pbs.twimg.com/profile_banners/868603454/1401294495", "profile_link_color": "0084B4", "profile_sidebar_border_color": "FFFFFF", "profile_sidebar_fill_color": "DDEEF6", "profile_text_color": "333333", "profile_use_background_image": true, "has_extended_profile": false, "default_profile": false, "default_profile_image": false, "following": false, "follow_request_sent": false, "notifications": false, "translator_type": "none", "withheld_in_countries": []}, "geo": null, "coordinates": null, "place": null, "contributors": null, "is_quote_status": false, "retweet_count": 1, "favorite_count": 0, "favorited": false, "retweeted": false, "possibly_sensitive": false, "possibly_sensitive_appealable": false, "lang": "en"}