{"created_at": "Tue Apr 24 17:41:48 +0000 2018", "id": 988835411609845761, "id_str": "988835411609845761", "full_text": "We'd venture to say that Cindy Crawford's daughter Kaia Gerber has had it pretty good as a brunette, especially since she inherited that brown hair — and the rest of her features — from her supermodel mom.\n\nBut the 14-year-old seems to be testing the waters of being a blonde, posting a picture on Instagram yesterday of herself with piecey platinum locks.\n\nIt's not a permanent new 'do, though — she assured her followers it was 'just a lil wig', adding a smiley face emoticon.\n\nTrying a new 'do! Kaia Gerber showed off a short blonde wig on Instagram on Thursday\n\nReal hair: The 14-year-old has long, brown locks that tumble down to her waist — quite like her mom's\n\nTwins! Kaia often draws comparisons to her mother, and had the same features — and same long legs — as the supermodel\n\nWith her slicked locks and bold, dark brows, the young model looks a whole lot more like singer Rita Ora than her lookalike mom in the one-off picture.\n\nAt shoulder length, the wig is much shorter than her real hair, too, which usually tumbles down to her waist.\n\nKaia shared the picture just hours after letting her brown locks flow for a lunch with her mom and One Direction star Harry Styles .\n\nStopping by Cafe Habana in Malibu for a catch-up, the 22-year-old singer could be seen enjoying a meal and with the supermodel, 50, her husband Rande Gerber, and Kaia.\n\nHarry — who has previously visited the Crawford/Gerber clan at their home — looked pleased to be spending some of his downtime catching up with old friends in California.\n\nArriving at the family's table in the upmarket Cuban and Mexican eatery, the One Direction star was greeted with a warm embrace and a kiss on the cheek from world-famous beauty.\n\nEarlier that day: Kaia had enjoyed lunch with her parents and One Directioner Harry Styles on Thursday\n\nBlossoming friends: Kaia was particularly thrilled when Harry arrived at the house in 2014, and even had a snap of herself and the 1D star taken\n\nThe long-haired lothario teamed a tropical-inspired shirt with a pair of skinny fit denim jeans and suede camel boots.\n\nMeanwhile, Kaia — who graces the cover of April's Vogue Paris with her mother — opted for an all-black ensemble, teaming a sleeveless top with skin-tight jeans and a pair of leather Chelsea boots.\n\nCindy wore a cream blouse, which she kept casual with form-fitting denim jeans. With her famous chestnut locks falling down past her shoulders, the model highlighted her naturally striking and extremely youthful visage.\n\nFormer male model and businessman Rande dressed in a relaxed outfit like Harry, donning a navy short-sleeved shirt, jeans and boots.\n\nThe Styles/Crawford friendship appeared to first blossom in summer 2014 when Harry paid a visit to Cindy's home to visit her son Presley — who had just had his tonsils out.\n\nAnd following the home visit, the family and Harry were seen enjoying some downtime in Canada, with the boys enjoying some cliff diving.\n\nHobnobbing with boybanders: Cindy has also taken Kaia to One Direction concerts\n\nPizza buddies: The Styles/Crawford friendship appeared to first blossom in summer 2014 when Harry paid a visit to Cindy's home to visit her son Presley — who had just had his tonsils out\n\nDaredevil dudes: And following the home visit the family and Harry were seen enjoying some downtime in Canada, with the boys enjoying some cliff diving\n\nDuring their time at Cindy's home, Harry gave Cindy some of his valuable expertise that he picked up when he worked in a bakery before finding success as a pop star.\n\nShe told V Magazine in 2014: 'He stopped by to say hi when my kids and I were making pizzas. My kids were doing their own little pizzas and they couldn't slide them off the pan.\n\n'Harry goes, ''Well, did you put down enough flour so they wouldn't stick?\"'\n\n'My husband says, ''How in the world do you know that?'' and my little girl chimes in, ''Oh, he used to work for a bakery, dad. Everyone knows that.\"'\n\nPlaying the role of embarrassing mom well, she added that her then-12-year-old daughter had a crush on Harry.", "truncated": false, "display_text_range": [0, 101], "entities": {"hashtags": [], "symbols": [], "user_mentions": [], "urls": [{"url": "https://t.co/DadpVtKY1o", "expanded_url": "https://www.gossipcop.com/justin-bieber-cindy-crawford-daughter-kaia-gerber/", "display_url": "gossipcop.com/justin-bieber-…", "indices": [78, 101]}]}, "source": "<a href=\"http://twitter.com\" rel=\"nofollow\">Twitter Web Client</a>", "in_reply_to_status_id": null, "in_reply_to_status_id_str": null, "in_reply_to_user_id": null, "in_reply_to_user_id_str": null, "in_reply_to_screen_name": null, "user": {"id": 2276848446, "id_str": "2276848446", "name": "DJ David Newsroom", "screen_name": "DJDavidNewsroom", "location": "Los Angeles, CA", "description": "keeping up for news, sports, gossip and music videos and trending stories and retweets made by @Davidfunny971", "url": "https://t.co/8aQCwA4fgL", "entities": {"url": {"urls": [{"url": "https://t.co/8aQCwA4fgL", "expanded_url": "http://djdavidnewsroom.tumblr.com", "display_url": "djdavidnewsroom.tumblr.com", "indices": [0, 23]}]}, "description": {"urls": []}}, "protected": false, "followers_count": 434, "friends_count": 4990, "listed_count": 17, "created_at": "Sun Jan 05 00:43:19 +0000 2014", "favourites_count": 2078, "utc_offset": null, "time_zone": null, "geo_enabled": true, "verified": false, "statuses_count": 55533, "lang": null, "contributors_enabled": false, "is_translator": false, "is_translation_enabled": false, "profile_background_color": "C0DEED", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme1/bg.png", "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme1/bg.png", "profile_background_tile": true, "profile_image_url": "http://pbs.twimg.com/profile_images/815687025953099776/47LexIhg_normal.jpg", "profile_image_url_https": "https://pbs.twimg.com/profile_images/815687025953099776/47LexIhg_normal.jpg", "profile_banner_url": "https://pbs.twimg.com/profile_banners/2276848446/1483259000", "profile_link_color": "333333", "profile_sidebar_border_color": "000000", "profile_sidebar_fill_color": "DDEEF6", "profile_text_color": "0084B4", "profile_use_background_image": true, "has_extended_profile": false, "default_profile": false, "default_profile_image": false, "following": false, "follow_request_sent": false, "notifications": false, "translator_type": "none", "withheld_in_countries": []}, "geo": null, "coordinates": null, "place": null, "contributors": null, "is_quote_status": false, "retweet_count": 1, "favorite_count": 0, "favorited": false, "retweeted": false, "possibly_sensitive": false, "possibly_sensitive_appealable": false, "lang": "en"}